// src/data/countries.js

export const countries = [
  // 아시아 주요 국가
  { name: "대한민국", lat: 36.2048, lon: 127.9954 },
  { name: "일본", lat: 36.2048, lon: 138.2529 },
  { name: "중국", lat: 35.8617, lon: 104.1954 },
  // { name: "싱가포르", lat: 1.3521, lon: 103.8198 },
  // { name: "인도", lat: 20.5937, lon: 78.9629 },

  // 북미 주요 국가
  { name: "미국", lat: 37.0902, lon: -95.7129 },
  // { name: "캐나다", lat: 56.1304, lon: -106.3468 },
  // { name: "멕시코", lat: 23.6345, lon: -102.5528 },

  // 유럽 주요 국가
  { name: "영국", lat: 55.3781, lon: -3.436 },
  // { name: "프랑스", lat: 46.6034, lon: 1.8883 },
  // { name: "독일", lat: 51.1657, lon: 10.4515 },
  // { name: "러시아", lat: 61.524, lon: 105.3188 },

  // 남미 주요 국가
  { name: "브라질", lat: -14.235, lon: -51.9253 },

  // 오세아니아 주요 국가
  { name: "호주", lat: -25.2744, lon: 133.7751 },

  // 아프리카 주요 국가
  { name: "남아프리카 공화국", lat: -30.5595, lon: 22.9375 },
];
